In [1]:
import pandas as pd

# Series---1d array
# Data frame---2d array(Table format,row & col)

In [2]:
a=pd.Series([])
b=pd.Series([1,2,33,47,58,100])
c=pd.Series([45,85,20,30,44])
d=pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\Prerna Chauhan\AppData\Local\Temp\ipykernel_16680\3794986783.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    85
2    20
3    30
4    44
dtype: int64

In [10]:
import numpy as np

In [11]:
n = np.array([1,2,3,4])

In [12]:
x = pd.Series(n)

In [13]:
x

0    1
1    2
2    3
3    4
dtype: int32

In [14]:
type(x)

pandas.core.series.Series

In [15]:
pd.Series([1,2,[11,10],33,[12,23],47,58,100])

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [18]:
b[3:7]

3     47
4     58
5    100
dtype: int64

In [19]:
d['d']

99

In [16]:
b[0]

1

In [17]:
b[2]

33

In [20]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [21]:
s = pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [22]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [23]:
s1 = pd.Series([12,52,42,10,23],index=list('qwert'))

In [24]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [25]:
s2 = pd.Series([12,52,12,52,10,23,42,10,23])

In [26]:
s2

0    12
1    52
2    12
3    52
4    10
5    23
6    42
7    10
8    23
dtype: int64

In [27]:
s2.value_counts()

12    2
52    2
10    2
23    2
42    1
dtype: int64

In [28]:
s2.argmax()

1

In [29]:
s2.argmin()

4

In [30]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [31]:
s1.idxmax()

'w'

In [32]:
s1.idxmin()

'r'

# DATA FRAME

In [33]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [34]:
a

Empty DataFrame
Columns: []
Index: []

In [36]:
type(b)

pandas.core.frame.DataFrame

In [35]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [41]:
c = pd.DataFrame([[1,2,3],[10,20,30],[7,8,9],[4,51,2],[5,8,9],[74,100,20],[45,65,30],[41,14,10]])

In [42]:
c

    0    1   2
0   1    2   3
1  10   20  30
2   7    8   9
3   4   51   2
4   5    8   9
5  74  100  20
6  45   65  30
7  41   14  10

In [45]:
c.head(2)

    0   1   2
0   1   2   3
1  10  20  30

In [46]:
c.tail(3)

    0    1   2
5  74  100  20
6  45   65  30
7  41   14  10

In [47]:
c.sample()

    0    1   2
5  74  100  20

In [48]:
c.sample(5)

    0   1   2
2   7   8   9
3   4  51   2
0   1   2   3
7  41  14  10
4   5   8   9

In [39]:
d = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15],[16,17,18,19,20],[21,22,23,24,25]])

In [40]:
d

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [49]:
c.head()

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9
3   4  51   2
4   5   8   9

In [50]:
c.tail()

    0    1   2
3   4   51   2
4   5    8   9
5  74  100  20
6  45   65  30
7  41   14  10

In [51]:
c1 = pd.DataFrame([[1,2],[10,20,30],[7,8],[4,51,2],[5,8,9],[74,100],[45,65,30],[41,14,10]])

In [52]:
c1

    0    1     2
0   1    2   NaN
1  10   20  30.0
2   7    8   NaN
3   4   51   2.0
4   5    8   9.0
5  74  100   NaN
6  45   65  30.0
7  41   14  10.0

In [56]:
c2 = pd.DataFrame([[1,2],[10,30],[7,8],[4,51,2],[5,8,9],[74,100],[45,65,30],[41,14,10]])

In [57]:
c2

    0    1     2
0   1    2   NaN
1  10   30   NaN
2   7    8   NaN
3   4   51   2.0
4   5    8   9.0
5  74  100   NaN
6  45   65  30.0
7  41   14  10.0

In [58]:
c3 = pd.DataFrame([[1,2],[10,np.nan,30],[7,8],[4,51,2],[5,8,9],[74,100,np.nan],[45,65,30],[41,14,10]])

In [59]:
c3

    0      1     2
0   1    2.0   NaN
1  10    NaN  30.0
2   7    8.0   NaN
3   4   51.0   2.0
4   5    8.0   9.0
5  74  100.0   NaN
6  45   65.0  30.0
7  41   14.0  10.0

In [60]:
c4 = pd.DataFrame([[1,2],[10,np.nan,30],[7,8,'Missing'],[4,51,2],[5,8,9],[74,100,np.nan],[45,'Missing',30],[41,14,10]])

In [61]:
c4

    0        1        2
0   1        2     None
1  10      NaN       30
2   7        8  Missing
3   4       51        2
4   5        8        9
5  74      100      NaN
6  45  Missing       30
7  41       14       10

In [62]:
s1 = pd.Series([12,52,42,10,23],index=list('ABCDE'))

In [63]:
s1

A    12
B    52
C    42
D    10
E    23
dtype: int64

In [65]:
c5 = pd.DataFrame([[1,2],[10,np.nan,30],[7,8,'Missing'],[4,51,2],[5,8,9],[74,100,np.nan],[45,'Missing',30],[41,14,10]],columns=['colA','colB','colC'])

In [66]:
c5

   colA     colB     colC
0     1        2     None
1    10      NaN       30
2     7        8  Missing
3     4       51        2
4     5        8        9
5    74      100      NaN
6    45  Missing       30
7    41       14       10

In [67]:
c5['colB']

0          2
1        NaN
2          8
3         51
4          8
5        100
6    Missing
7         14
Name: colB, dtype: object

In [68]:
c5[['colB','colC']]

      colB     colC
0        2     None
1      NaN       30
2        8  Missing
3       51        2
4        8        9
5      100      NaN
6  Missing       30
7       14       10

In [69]:
c5.head(2)

   colA colB  colC
0     1    2  None
1    10  NaN    30

In [70]:
c5.head(3)

   colA colB     colC
0     1    2     None
1    10  NaN       30
2     7    8  Missing

In [71]:
c5.head(4)

   colA colB     colC
0     1    2     None
1    10  NaN       30
2     7    8  Missing
3     4   51        2

In [72]:
c5[['colB','colC']].head(4)

  colB     colC
0    2     None
1  NaN       30
2    8  Missing
3   51        2

In [73]:
c5[['colB','colC']].head(3)

  colB     colC
0    2     None
1  NaN       30
2    8  Missing

In [74]:
c5[['colB','colC']][1:4]

  colB     colC
1  NaN       30
2    8  Missing
3   51        2

In [75]:
c1.shape

(8, 3)

In [76]:
c5['colA'].argmax()

5

In [77]:
c5['colA'].argmin()

0

In [78]:
c5['colA'].max()

74

In [79]:
c5['colA'].min()

1

In [80]:
c5['new_col'] = [12,45,77,44,88,20,30,14]

In [81]:
c5

   colA     colB     colC  new_col
0     1        2     None       12
1    10      NaN       30       45
2     7        8  Missing       77
3     4       51        2       44
4     5        8        9       88
5    74      100      NaN       20
6    45  Missing       30       30
7    41       14       10       14

In [82]:
c5['new_col2'] = [2,45,7,44,8,20,50,44]

In [83]:
c5

   colA     colB     colC  new_col  new_col2
0     1        2     None       12         2
1    10      NaN       30       45        45
2     7        8  Missing       77         7
3     4       51        2       44        44
4     5        8        9       88         8
5    74      100      NaN       20        20
6    45  Missing       30       30        50
7    41       14       10       14        44

In [84]:
c5['colD'] = c5['new_col']+c5['new_col2']

In [85]:
c5

   colA     colB     colC  new_col  new_col2  colD
0     1        2     None       12         2    14
1    10      NaN       30       45        45    90
2     7        8  Missing       77         7    84
3     4       51        2       44        44    88
4     5        8        9       88         8    96
5    74      100      NaN       20        20    40
6    45  Missing       30       30        50    80
7    41       14       10       14        44    58

In [86]:
c5['colD'].max()

96

In [87]:
c5['colD']>50

0    False
1     True
2     True
3     True
4     True
5    False
6     True
7     True
Name: colD, dtype: bool

In [88]:
f = c5['colD']>50

In [89]:
c5[f]

   colA     colB     colC  new_col  new_col2  colD
1    10      NaN       30       45        45    90
2     7        8  Missing       77         7    84
3     4       51        2       44        44    88
4     5        8        9       88         8    96
6    45  Missing       30       30        50    80
7    41       14       10       14        44    58

In [91]:
c5['colD']<50

0     True
1    False
2    False
3    False
4    False
5     True
6    False
7    False
Name: colD, dtype: bool

In [92]:
g =c5['colD']<50

In [93]:
c5[g]

   colA colB  colC  new_col  new_col2  colD
0     1    2  None       12         2    14
5    74  100   NaN       20        20    40